---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviser.GetNumberOfRules
source: html/0b9a4fe7-9bc7-1d6f-18ec-413173ee59c6.htm
---
# Autodesk.Revit.DB.PerformanceAdviser.GetNumberOfRules Method

Retrieves number of performance adviser rules in the list.

## Syntax (C#)
```csharp
public int GetNumberOfRules()
```

## Returns
Number of performance adviser rules in the list.